## San Diego area donors to the candidates of the Jan. 5, 2020 Georgia Senate races

Luke Harold 

** includes data from the cities of San Diego, Del Mar, Solana Beach, Encinitas, Carlsbad and Oceanside

In [31]:
import pandas as pd

In [32]:
georgia = pd.read_csv("schedule_a-2021-01-05T20_53_43.csv")

In [33]:
georgia.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 753 entries, 0 to 752
Data columns (total 79 columns):
 #   Column                                 Non-Null Count  Dtype
---  ------                                 --------------  -----
 0   committee_id                           753 non-null    object
 1   committee_name                         753 non-null    object
 2   report_year                            753 non-null    int64
 3   report_type                            753 non-null    object
 4   image_number                           753 non-null    int64
 5   line_number                            753 non-null    object
 6   transaction_id                         753 non-null    object
 7   file_number                            753 non-null    int64
 8   committee_name.1                       0 non-null      float64
 9   entity_type                            753 non-null    object
 10  entity_type_desc                       753 non-null    object
 11  unused_contbr_id                       702 non-null    object
 12  contributor_prefix                     0 non-null      float64
 13  contributor_name                       753 non-null    object
 14  recipient_committee_type               753 non-null    object
 15  recipient_committee_org_type           0 non-null      float64
 16  recipient_committee_designation        753 non-null    object
 17  contributor_first_name                 753 non-null    object
 18  contributor_middle_name                40 non-null     object
 19  contributor_last_name                  753 non-null    object
 20  contributor_suffix                     1 non-null      object
 21  contributor_street_1                   753 non-null    object
 22  contributor_street_2                   161 non-null    object
 23  contributor_city                       753 non-null    object
 24  contributor_state                      753 non-null    object
 25  contributor_zip                        753 non-null    int64
 26  contributor_employer                   753 non-null    object
 27  contributor_occupation                 753 non-null    object
 28  contributor_id                         702 non-null    object
 29  receipt_type                           753 non-null    object
 30  receipt_type_desc                      753 non-null    object
 31  receipt_type_full                      31 non-null     object
 32  memo_code                              13 non-null     object
 33  memo_code_full                         0 non-null      float64
 34  contribution_receipt_date              753 non-null    object
 35  contribution_receipt_amount            753 non-null    float64
 36  contributor_aggregate_ytd              753 non-null    float64
 37  candidate_id                           0 non-null      float64
 38  candidate_name                         0 non-null      float64
 39  candidate_first_name                   0 non-null      float64
 40  candidate_last_name                    0 non-null      float64
 41  candidate_middle_name                  0 non-null      float64
 42  candidate_prefix                       0 non-null      float64
 43  candidate_suffix                       0 non-null      float64
 44  candidate_office                       0 non-null      float64
 45  candidate_office_full                  0 non-null      float64
 46  candidate_office_state                 0 non-null      float64
 47  candidate_office_state_full            0 non-null      float64
 48  candidate_office_district              0 non-null      float64
 49  conduit_committee_id                   0 non-null      float64
 50  conduit_committee_name                 0 non-null      float64
 51  conduit_committee_street1              0 non-null      float64
 52  conduit_committee_street2              0 non-null      float64
 53  conduit_committee_city                 0 non-null      float64
 54  conduit_committee_state                0 non-null      float64
 55  conduit_committee_zip                  0 non-null      float64
 56  donor_committee_name                   0 non-null      float64
 57  national_committee_nonfederal_account  0 non-null      float64
 58  election_type                          753 non-null    object
 59  election_type_full                     260 non-null    object
 60  fec_election_type_desc                 688 non-null    object
 61  fec_election_year                      748 non-null    float64
 62  amendment_indicator                    753 non-null    object
 63  amendment_indicator_desc               753 non-null    object
 64  schedule_type_full                     753 non-null    object
 65  load_date                              753 non-null    object
 66  original_sub_id                        0 non-null      float64
 67  back_reference_transaction_id          696 non-null    object
 68  back_reference_schedule_name           696 non-null    object
 69  filing_form                            753 non-null    object
 70  link_id                                753 non-null    int64
 71  is_individual                          753 non-null    object
 72  memo_text                              684 non-null    object
 73  two_year_transaction_period            753 non-null    int64
 74  schedule_type                          753 non-null    object
 75  increased_limit                        0 non-null      float64
 76  sub_id                                 753 non-null    int64
 77  pdf_url                                753 non-null    object
 78  line_number_label                      753 non-null    object
dtypes: float64(30), int64(7), object(42)
memory usage: 464.9+ KB

In [128]:
by_city = georgia[georgia.contributor_city == "DEL MAR"]

In [129]:
by_candidate = by_city[by_city.committee_name.str.contains("PERDUE")]

In [130]:
by_candidate[['contributor_last_name','contributor_first_name', 'contributor_employer','contribution_receipt_amount']]

,contributor_last_name,contributor_first_name,contributor_employer,contribution_receipt_amount
104,ANTONIO,FRANKLIN,QUALCOMM TECHNOLOGIES INC,2800.0
113,JAMESON,JAMES,SELF-EMPLOYED,1000.0
445,ANTONIO,FRANKLIN,QUALCOMM TECHNOLOGIES INC,2800.0

In [110]:
by_candidate.contribution_receipt_amount.sum

14293.32

In [ ]:
# City of San Diego

In [111]:
# PERDUE 5530
# LOEFFLER 800

5530 + 800

6330

In [112]:
# OSSOFF 77660.99
# WARNOCK 25741.68

77660.99 + 25741.68

103402.67000000001

In [ ]:
# City of Del Mar

In [113]:
# PERDUE 6600
# LOEFFLER 2800

6600 + 2800

9400

In [114]:
# OSSOFF 14293.32
# WARNOCK 12714.91

14293.32 + 12714.91

27008.23

In [ ]:
# City of Solana Beach

In [115]:
# PERDUE 500
# LOEFFLER 0

500 + 0

500

In [116]:
# OSSOFF 807.15
# WARNOCK 357.14

807.15 + 357.14

1164.29

In [127]:
by_candidate.groupby("contributor_employer").contribution_receipt_amount.sum().reset_index().sort_values("contribution_receipt_amount",ascending=False)

             contributor_employer  contribution_receipt_amount
3                    NOT EMPLOYED                      5473.43
0    EFC MANAGEMENT COMPANY, INC.                      4909.89
2  JACOBS INVESTMENT COMPANY, LLC                      2800.00
4                   SELF EMPLOYED                       800.00
1                 GENERAL ATOMICS                       310.00

In [ ]:
# search by donor name

In [138]:
by_donor = georgia[georgia.contributor_last_name == "BERRY"]

In [139]:
by_donor[['contributor_first_name','contributor_last_name','contribution_receipt_amount','committee_name']]

,contributor_first_name,contributor_last_name,contribution_receipt_amount,committee_name
750,CHARLES,BERRY,2800.0,OSSOFF-WARNOCK VICTORY FUND

In [143]:
georgia.groupby("contributor_employer").contribution_receipt_amount.sum().reset_index().sort_values("contribution_receipt_amount",ascending=False)

            contributor_employer  contribution_receipt_amount
55                  NOT EMPLOYED                     79464.26
64     QUALCOMM TECHNOLOGIES INC                      8400.00
30  EFC MANAGEMENT COMPANY, INC.                      8019.78
75                 SELF EMPLOYED                      6483.33
82           STRELITZIA VENTURES                      5600.00
..                           ...                          ...
66              QUESTGARDEN, INC                       125.00
9                      BIOLEGEND                       125.00
77                           SIE                       100.00
14                           CCR                        53.45
59                           PBA                        50.00

[97 rows x 2 columns]

In [159]:
by_employer = georgia[georgia.contributor_employer.str.contains("UC")]

In [160]:
by_employer[["committee_name","contributor_employer"]]

                  committee_name contributor_employer
69         JON OSSOFF FOR SENATE              UCSD UW
131        JON OSSOFF FOR SENATE              UCSD UW
149        JON OSSOFF FOR SENATE              UCSD UW
152        JON OSSOFF FOR SENATE              UCSD UW
344        JON OSSOFF FOR SENATE              UCSD UW
409        JON OSSOFF FOR SENATE              UCSD UW
750  OSSOFF-WARNOCK VICTORY FUND         UC SAN DIEGO